const PrivacyPolicy = () => {
  return (
    <div className="privacy-policy-container p-6 text-gray-200 px-[10%]">
      <h1 className="text-3xl font-bold mb-4">গোপনীয়তা নীতি</h1>

      <p className="mb-10 text-xl">
        Vertex for BCS পরিচালিত বিসিএস কোচিং সেন্টার আপনার ব্যক্তিগত গোপনীয়তা
        রক্ষায় বদ্ধপরিকর। আমরা কীভাবে তথ্য সংগ্রহ করি, কীভাবে তার সুরক্ষা দেই,
        কীভাবে এবং কী উদ্দেশ্যে তা ব্যবহার করি সেই বিষয়টি এখানে ব্যাখ্যা করা
        আছে।
      </p>

      <h2 className="text-2xl font-semibold mb-4">যেসব তথ্য আমরা সংগ্রহ করি</h2>
      <p className="mb-10 text-xl">
        আমরা আপনার নিম্নলিখিত তথ্যগুলো সংগ্রহ করি এবং তা আমাদের সার্ভিসের
        প্রয়োজনে ব্যবহার করে থাকি:
      </p>
      <ul className="list-disc ml-8 mb-10 text-xl">
        <li>
          ব্যক্তির পরিচিতি সংক্রান্ত তথ্য: নাম, ঠিকানা, ইমেইল অ্যাড্রেস, মোবাইল
          নম্বর, জন্ম তারিখ, জাতীয় পরিচয়পত্র/জন্ম সনদ, শিক্ষাগত সনদ, পিএসসির
          রেজিস্ট্রেশন নম্বর ইত্যাদি।
        </li>
        <li>
          কারিগরি উপাত্ত: ইন্টারনেট প্রোটোকল অ্যাড্রেস, ব্রাউজার ধরন, টাইম জোন,
          অপারেটিং সিস্টেম ইত্যাদি।
        </li>
        <li>
          ব্যবহৃত উপাত্ত: আপনি কীভাবে আমাদের ওয়েবসাইট পরিদর্শন করছেন, কী কী সেবা
          নিচ্ছেন এসব বিষয় আমরা সংগ্রহ করে থাকি।
        </li>
      </ul>

      <h2 className="text-2xl font-semibold mb-4">
        আমরা যে কারণে তথ্য/উপাত্ত সংগ্রহ করি
      </h2>
      <p className="mb-10 text-xl">
        আমরা আপনার তথ্য নিম্নলিখিত উদ্দেশ্যগুলোর জন্য সংগ্রহ করি:
      </p>
      <ul className="list-disc ml-8 mb-10 text-xl">
        <li>
          আমাদের সেবার মান উন্নত করতে, বিশেষ করে কাস্টমার সেবা নিশ্চিত করতে।
        </li>
        <li>আমাদের সেবাকে আরো বিকশিত, অর্থবহ ও কার্যকর করে তুলতে।</li>
        <li>আপনার সাথে সর্বদা যোগাযোগ রক্ষার স্বার্থে।</li>
        <li>আইনগত বাধ্যবাধকতা প্রতিপালন করতে।</li>
      </ul>

      <h2 className="text-2xl font-semibold mb-4">আপনার তথ্যের সুরক্ষা</h2>
      <p className="mb-10 text-xl">
        আমরা আপনার তথ্য সুরক্ষিত রাখতে সর্বোচ্চ নিরাপত্তা ব্যবস্থা গ্রহণ করি।
        আপনার তথ্যের গোপনীয়তা বজায় রাখার জন্য আমরা তৃতীয় কোনো পক্ষের সাথে
        বাণিজ্যিক উদ্দেশ্যে তা ভাগ করি না। তবে আইনগত বাধ্যবাধকতা অনুযায়ী
        রাষ্ট্রীয় কর্তৃপক্ষকে তথ্য সরবরাহ করতে হতে পারে।
      </p>

      <p className="mb-10 text-xl">
        Vertex for BCS বিশ্বাস করে যে আপনার তথ্যের সুরক্ষা ও গোপনীয়তা আমাদের
        সর্বোচ্চ অগ্রাধিকার। সুতরাং, নিশ্চিন্তে আমাদের ওয়েবসাইট ব্যবহার করুন এবং
        নির্ভয়ে আমাদের সেবা গ্রহণ করুন।
      </p>

      <p className="mb-10 text-xl">
        আরও তথ্যের জন্য, আপনি আমাদের সাপোর্ট টিমের সাথে যোগাযোগ করতে পারেন অথবা
        আমাদের 'যোগাযোগ' পৃষ্ঠায় গিয়ে বিস্তারিত জানতে পারবেন।
      </p>
    </div>
  );
};

export default PrivacyPolicy;
